In [1]:
# Import packages
from sqlalchemy import create_engine
import pandas as pd

# Create engine: engine
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [2]:
# Execute query and store records in DataFrame: df
df = pd.read_sql_query('SELECT * from Bookings', engine)

In [3]:
df.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [4]:
# Perform query and save results to DataFrame: df
with engine.connect() as con:
    rs = con.execute("SELECT sub.name, SUM( sub.revenue ) AS revenue FROM (SELECT b.facid, b.memid, f.name, f.guestcost, f.membercost, COUNT( b.facid ) AS facid_count,CASE WHEN b.memid =0 THEN COUNT( b.facid ) * f.guestcost ELSE COUNT( b.facid ) * f.membercost END AS 'revenue'FROM Bookings AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY b.facid, b.memid) AS sub GROUP BY sub.facid HAVING revenue <=1000;")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print head of DataFrame df
print(df)

              name  revenue
0  Badminton Court    604.5
1     Table Tennis     90.0
2    Snooker Table    115.0
3       Pool Table    265.0

In [5]:
# Perform query and save results to DataFrame: df
with engine.connect() as con:
    rs = con.execute("SELECT m.surname, m.firstname, m.recommendedby AS recomender_id, r.surname AS recomender_surname, r.firstname AS recomender_firstname FROM Members AS m LEFT JOIN Members AS r ON m.recommendedby = r.memid WHERE m.recommendedby != 0 ORDER BY r.surname, r.firstname;")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print head of DataFrame df
print(df)

              surname  firstname recomender_id recomender_surname  \
0               GUEST      GUEST                             None
1               Smith     Darren                             None
2               Smith      Tracy                             None
3              Rownam        Tim                             None
4               Tracy     Burton                             None
5             Farrell     Jemima                             None
6             Farrell      David                             None
7          Tupperware   Hyacinth                             None
8               Smith     Darren                             None
9              Sarwin  Ramnaresh            15              Bader
10             Coplin       Joan            16              Baker
11            Genting    Matthew             5            Butters
12              Baker    Timothy            13            Farrell
13             Pinker      David            13            Farrell
14             Rumney  Henrietta            20            Genting
15              Jones    Douglas            11              Jones
16               Dare      Nancy             4           Joplette
17              Jones      David             4           Joplette
18               Hunt       John            30            Purview
19             Boothe        Tim             3             Rownam
20           Joplette     Janice             1              Smith
21            Butters     Gerald             1              Smith
22               Owen    Charles             1              Smith
23              Smith       Jack             1              Smith
24          Mackenzie       Anna             1              Smith
25  Worthington-Smyth      Henry             2              Smith
26            Purview  Millicent             2              Smith
27            Crumpet      Erica             2              Smith
28              Baker       Anne             9           Stibbons
29              Bader   Florence             9           Stibbons
30           Stibbons     Ponder             6              Tracy

   recomender_firstname
0                  None
1                  None
2                  None
3                  None
4                  None
5                  None
6                  None
7                  None
8                  None
9              Florence
10              Timothy
11               Gerald
12               Jemima
13               Jemima
14              Matthew
15                David
16               Janice
17               Janice
18            Millicent
19                  Tim
20               Darren
21               Darren
22               Darren
23               Darren
24               Darren
25                Tracy
26                Tracy
27                Tracy
28               Ponder
29               Ponder
30               Burton

In [6]:
# Perform query and save results to DataFrame: df
with engine.connect() as con:
    rs = con.execute("SELECT b.facid, COUNT( b.memid ) AS mem_usage, f.name FROM (SELECT facid, memid FROM Bookings WHERE memid !=0) AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY b.facid;")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print head of DataFrame df
print(df)

   facid  mem_usage             name
0      0        308   Tennis Court 1
1      1        276   Tennis Court 2
2      2        344  Badminton Court
3      3        385     Table Tennis
4      4        421   Massage Room 1
5      5         27   Massage Room 2
6      6        195     Squash Court
7      7        421    Snooker Table
8      8        783       Pool Table

In [8]:
# Perform query and save results to DataFrame: df
with engine.connect() as con:
    rs = con.execute("SELECT b.months, COUNT( b.memid ) AS mem_usage FROM (SELECT strftime('%m', starttime ) AS months, memid FROM Bookings WHERE memid !=0 ) AS b GROUP BY b.months;")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

In [9]:
df

  months  mem_usage
0     07        480
1     08       1168
2     09       1512